#!/usr/bin/env python3

import sys
import random


ENCRPYTION_MAP = {
    'a': ['ª', '∀', '⟑', 'α'],
    'b': ['฿', 'В', 'ь', 'β'],
    'c': ['©', '∁', '⊂', '☪', '¢'],
    'd': ['∂', '⫒', 'ძ'],
    'e': ['ℇ', '℮', '∃', '∈', '∑', '⋿', '€', 'ϱ'],
    'f': ['⨍', '⨗', '⫭', '៛', 'ϝ', '𐅿'],
    'g': ['₲', 'ց', 'Ԍ'],
    'h': ['ℏ', '⫲', '⫳', '♓︎', '₶'],
    'i': ['ℹ︎', '⫯', 'ι', 'ї'],
    'j': ['⌡', 'ϳ', 'ј'],
    'k': ['₭', 'κ', 'Ϗ'],
    'l': ['∟', '₤', 'լ'],
    'm': ['≞', '⋔', '⨇', '⩋', '⫙', '♏︎', '₥'],
    'n': ['∏', '∩', 'η'],
    'o': ['º', '⦿', '☉', 'ο', 'օ'],
    'p': ['℗', '♇', '₱', 'ρ', 'բ'],
    'q': ['ԛ', 'զ', 'գ', '৭', 'ҩ'],
    'r': ['®', 'Я', 'Ւ', '𐅾'],
    's': ['∫', '$', 'ѕ'],
    't': ['⊺', '⟙', '✝', '♱', '♰', 'τ', 'է'],
    'u': ['µ', '∪', '∐', '⨃', ''],
    'v': ['∨', '√', '⩔', '♈︎'],
    'w': ['⨈', '⩊', '⫝', '₩', 'ω'],
    'x': ['×', '⨯', '☓', '✗'],
    'y': ['¥', '⑂', 'Ⴤ', 'ӱ'],
    'z': ['Ꙁ', 'Ⴠ', 'Հ'],
}


def unicode_encrypt(str_to_encrypt):
    return ''.join([random.choice(ENCRPYTION_MAP.get(c, c)) for c in str_to_encrypt.lower()])


def main():
    for line in sys.stdin:
        sys.stdout.write(unicode_encrypt(line))


if __name__ == '__main__':
    main()
